src/Documents/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Затраты</name>
  <basedOn>Document.Заявка</basedOn>
  <registerRecords>AccumulationRegister.РН_Анализ_Возможности_Затрат</registerRecords>
  <registerRecords>InformationRegister.ЦеныМагазинов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ТранспортныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.РН_МестаНакопленияДенег</registerRecords>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснМестоСклад</name>
    <type>
      <types>CatalogRef.Места_Объекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОплаты</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Семья</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьГСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонПокупки</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокИсточникаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВизЗатрат</name>
    <type>
      <types>EnumRef.ВидЗатрат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗатрат</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектПлатежа</name>
      <type>
        <types>CatalogRef.ДомашниеЖивотные</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Места_Объекты</types>
        <types>String</types>
        <types>CatalogRef.Люди</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Семья</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПлатежа</name>
      <comment>Зачем. дял чего во имя чего покупка</comment>
      <type>
        <types>CatalogRef.Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>Ценность</name>
      <type>
        <types>CatalogRef.Ценность</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Места_Объекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснЕдИзмерения</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолВоСравнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.ГруппаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзмСравнения</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныМагазинов/ЦеныМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныМагазинов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСравнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдИзмСравнения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснЕдИзмерения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.ГруппаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КолВоСравнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОснЕдИзмерения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзмСравнения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ценность</name>
    <type>
      <types>CatalogRef.Ценность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПлатежа</name>
    <type>
      <types>CatalogRef.ДомашниеЖивотные</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Места_Объекты</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.ГруппаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦельПлатежа</name>
    <comment>Зачем. дял чего во имя чего покупка</comment>
    <type>
      <types>CatalogRef.Цели</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Затраты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = СписокЗатрат.Итог("Сумма")-Скидка;
	//	ОбщаяСумма =
	//"ВЫБРАТЬ
	//|	СУММА(Покупка.СуммаДокумента) КАК СуммаДокумента
	//|ИЗ
	//|	Документ.Покупка КАК Покупка"	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	РайонПокупки = Справочники.Районы.НайтиПоНаименованию("Октябрьский");	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДокументОснования = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСписокЗаказа Из ДанныеЗаполнения.СписокЗаказа Цикл
			НоваяСтрока = СписокЗатрат.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокЗаказа.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаСписокЗаказа.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаСписокЗаказа.СуммаПлан;
			НоваяСтрока.Цена = ТекСтрокаСписокЗаказа.ЦенаПлан;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЦеныМагазинов
	Движения.ЦеныМагазинов.Записывать = Истина;
	Для Каждого ТекСтр Из СписокЗатрат Цикл
		Если НЕ ТекСтр.ЕдИзмСравнения.Пустая() И (ТипЗнч(Контрагент) = Тип("СправочникСсылка.КонтрагентМесто")
			И НЕ ТекСтр.КолВоСравнения = 0 или
			ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты")) Тогда
			Движение = Движения.ЦеныМагазинов.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтр.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.ГруппаНоменклатуры = ТекСтр.ГруппаНоменклатуры;
			Движение.Цена = ТекСтр.Цена;
			Движение.ЦенаСравнения = ТекСтр.Цена/ТекСтр.КолВоСравнения;
			Движение.ЕдИзмСравнения = ТекСтр.ЕдИзмСравнения;
			Движение.ОснЕдИзмерения = ТекСтр.ОснЕдИзмерения;
		КонецЕсли;
	КонецЦикла;
	
	// регистр Затраты 
	Движения.Затраты.Записывать = Истина;
	Для Каждого ТекСтр Из СписокЗатрат Цикл
		Движение = Движения.Затраты.Добавить();
		
		Движение.Период = Дата;
		Движение.Ценность = ТекСтр.Ценность;
		Движение.Номенклатура = ТекСтр.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.ОбъектПлатежа = ТекСтр.ОбъектПлатежа;
		
		Движение.ГруппаНоменклатуры = ТекСтр.ГруппаНоменклатуры;
		Движение.ЦельПлатежа = ТекСтр.ЦельПлатежа;
		Движение.КолВоСравнения = ТекСтр.КолВоСравнения;
		Движение.Количество = ТекСтр.Количество;
		Движение.Сумма = ТекСтр.Сумма;
		Движение.ОснЕдИзмерения = ТекСтр.ОснЕдИзмерения;
		Движение.ЕдИзмСравнения = ТекСтр.ЕдИзмСравнения;
		
	КонецЦикла;
	
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
